src/Catalogs/ВидыБонусныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыБонусныхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Именной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПриОплатеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченПроцентомСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеНачисленийПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСписанияПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДатойПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДатойС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачисленийТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленияВДеньРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриветственногоНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОбмена</Name>
					<Comment>Курс конвертации SKLLZZ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПакетУслугСоставУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаСегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОграниченийСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОграниченийСрокаДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бессрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокДействия_С_По</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокОграниченПериодом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыБонусныхСчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ОграничениеПоСрокуДействия 			= Перечисления.ТипыОграниченийСрокаДействия.Бессрочный;
		Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный;
		
	КонецЕсли;

	ПараметрыСозданияЭлементовФормы = Новый Структура;
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугГруппаЭлементов"          	 , "СоставЧленстваПакетаУслугСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугПереключательУслугаСегмент" , "ЧленствоПакетУслугСоставУслугПереключательУслугаСегментПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугУслугаСегмент"            	 , "ЧленствоПакетУслугСоставУслугУслугаСегментПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугВидЦены"               	 , "ЧленствоПакетУслугСоставУслугВидЦеныПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугИспользоватьПосещенийНеЧаще", "ЧленствоПакетУслугСоставУслугИспользоватьПериодНеЧащеПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугПосещенийНеЧаще"   		 , "ЧленствоПакетУслугСоставУслугПериодНеЧащеПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугПосещенийНеЧащеТип"   		 , "ЧленствоПакетУслугСоставУслугПосещенийНеЧащеТипПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугПроцентСписания"  			 , "ЧленствоПакетУслугСоставУслугПроцентСписания_");
	ПараметрыСозданияЭлементовФормы.Вставить("СоставУслугКнопкаУдалить"   			 , "УдалитьСтрочкуУслугСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("ВремяДействияГруппаЭлементов"          , "ВремяДействияЧленстваПакетаУслугСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("ВремяДействияДеньНедели"				 , "ЧленствоПакетУслугВремяДействияДеньНеделиПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("ВремяДействияВремяС"            		 , "ЧленствоПакетУслугВремяДействияВремяСПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("ВремяДействияВремяПо"               	 , "ЧленствоПакетУслугВремяДействияВремяПоПолемСтрока_");
	ПараметрыСозданияЭлементовФормы.Вставить("ВремяДействияКнопкаУдалить"   		 , "УдалитьСтрочкуВремяДействияСтрока_");
	
	// Если Объект.Ссылка.Пустая() И Объект.ПакетУслугСоставУслуг.Количество() = 0	Тогда
	//	НоваяСтрока = Объект.ПакетУслугСоставУслуг.Добавить();
	// КонецЕсли;	
	
	// Создаем элемент существующих строк состава услуг
	Для Каждого СтрокаТЗ ИЗ Объект.ПакетУслугСоставУслуг Цикл
		ДобавитьЭлементыФормыСоставаУслуг(СтрокаТЗ.ПолучитьИдентификатор());
	КонецЦикла;
	
	УстановитьВидимостьЭлементов();
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ОграничениеПоСрокуДействияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура СрокДествияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ДобавитьСтрочкуДоступныхУслуг(Команда)
	
	ДобавитьСтрочкуДоступныхУслугНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
//
//
Процедура ДобавитьСтрочкуДоступныхУслугНаСервере()
	
	ДобавитьЭлементыФормыСоставаУслуг();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
// Добавить элементы формы, для новго времени занятия
//
Процедура ДобавитьЭлементыФормыСоставаУслуг(ИДСтрокиДанных = Неопределено)
	
	// Если это добавление элементов формы для новой строки данных
	СтрокаДанных = Неопределено;
	Если ИДСтрокиДанных <> Неопределено Тогда		
		СтрокаДанных  	= Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);
	Иначе
		СтрокаДанных    = Объект.ПакетУслугСоставУслуг.Добавить();
		ИДСтрокиДанных  = СтрокаДанных.ПолучитьИдентификатор();
	КонецЕсли;
	
	ГруппаНовыхЭл = Неопределено;
	Если Элементы.Найти(ПараметрыСозданияЭлементовФормы.СоставУслугГруппаЭлементов + ИДСтрокиДанных) <> Неопределено Тогда		
		ГруппаНовыхЭл = Элементы.Найти(ПараметрыСозданияЭлементовФормы.СоставУслугГруппаЭлементов + ИДСтрокиДанных);
	Иначе
		ГруппаНовыхЭл                                   = Элементы.Вставить(ПараметрыСозданияЭлементовФормы.СоставУслугГруппаЭлементов + ИДСтрокиДанных, Тип("ГруппаФормы"), Элементы.СоставЧленстваПакетаУслугСостав, Элементы.ГруппаСоставЧленстваПакетаУслугСоставПодвал);
		ГруппаНовыхЭл.Вид                               = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаНовыхЭл.Группировка                       = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаНовыхЭл.Отображение                       = ОтображениеОбычнойГруппы.Нет;
		ГруппаНовыхЭл.ОтображатьЗаголовок               = Ложь;
	КонецЕсли;
	
	// Добавляем поле ПереключательУслугаСегмент
	ПолеНовогоЭлемента                           = Элементы.Добавить(ПараметрыСозданияЭлементовФормы.СоставУслугПереключательУслугаСегмент + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);													 
	ПолеНовогоЭлемента.Вид                       = ВидПоляФормы.ПолеПереключателя;
	ПолеНовогоЭлемента.ВидПереключателя          = ВидПереключателя.Тумблер;
	ПолеНовогоЭлемента.ОдинаковаяШиринаКолонок	 = Истина;
	ПолеНовогоЭлемента.ШиринаЭлемента			 = 11;
	ПолеНовогоЭлемента.ПоложениеЗаголовка   	 = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНовогоЭлемента.СписокВыбора.Добавить(0, НСтр("ru= 'Номенклатура';en ='Nomenclature'"));
	ПолеНовогоЭлемента.СписокВыбора.Добавить(1, НСтр("ru= 'Сегмент';en ='Segment'"));
	ПолеНовогоЭлемента.ПутьКДанным               = "Объект.ПакетУслугСоставУслуг[" + (СтрокаДанных.НомерСтроки-1) +"].ПереключательДляВыбораУслугаСегмент";	
	ПолеНовогоЭлемента.УстановитьДействие("ПриИзменении", "ПакетУслугСоставУслугУслугаСегментПриИзменении_Подключаемый");
	Если ТипЗнч(Объект.ПакетУслугСоставУслуг[СтрокаДанных.НомерСтроки-1].УслугаСегмент) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		Объект.ПакетУслугСоставУслуг[СтрокаДанных.НомерСтроки-1].ПереключательДляВыбораУслугаСегмент = 1;
	КонецЕсли;
	
	// Добавляем поле УслугаСегмент
	ПолеНовогоЭлемента                      	= Элементы.Добавить(ПараметрыСозданияЭлементовФормы.СоставУслугУслугаСегмент + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПолеНовогоЭлемента.Вид                  	= ВидПоляФормы.ПолеВвода;
	ПолеНовогоЭлемента.АвтоМаксимальнаяШирина   = Ложь;
	ПолеНовогоЭлемента.МаксимальнаяШирина       = 35;
	ПолеНовогоЭлемента.ПутьКДанным          	= "Объект.ПакетУслугСоставУслуг[" + (СтрокаДанных.НомерСтроки-1) +"].УслугаСегмент";
	ПолеНовогоЭлемента.ПоложениеЗаголовка   	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНовогоЭлемента.КнопкаВыпадающегосписка 	= Ложь;
	ПолеНовогоЭлемента.КнопкаВыбора				= Истина;
	ПолеНовогоЭлемента.ОтображениеКнопкиВыбора 	= ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	ПолеНовогоЭлемента.ВыбиратьТип        		= Ложь;
	ПолеНовогоЭлемента.РастягиватьПоГоризонтали = Истина;
	ПолеНовогоЭлемента.АвтоОтметкаНезаполненного = Истина;
	ПолеНовогоЭлемента.УстановитьДействие("НачалоВыбора", "ПакетУслугСоставУслугУслугаСегментПриИзменении_Подключаемый");
	ПолеНовогоЭлемента.УстановитьДействие("Очистка", "ПакетУслугСоставУслугУслугаСегментОчистка");
	
	// Добавляем поле ВидЦены
	ПолеНовогоЭлемента                           = Элементы.Добавить(ПараметрыСозданияЭлементовФормы.СоставУслугВидЦены + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);													 
	ПолеНовогоЭлемента.Вид                       = ВидПоляФормы.ПолеВвода;
	ПолеНовогоЭлемента.АвтоМаксимальнаяШирина    = Ложь;
	ПолеНовогоЭлемента.МаксимальнаяШирина        = 11;
	ПолеНовогоЭлемента.КнопкаВыбора              = Истина;
	ПолеНовогоЭлемента.РастягиватьПоГоризонтали  = Истина;
	ПолеНовогоЭлемента.ПоложениеЗаголовка		 = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНовогоЭлемента.ПодсказкаВвода			 = "Вид цены";
	ПолеНовогоЭлемента.ПутьКДанным               = "Объект.ПакетУслугСоставУслуг[" + ИДСтрокиДанных +"].ВидЦены";	
	ПолеНовогоЭлемента.УстановитьДействие("ПриИзменении", "УстановитьВидимостьЭлементовПриИзменении");	
	
	// Добавляем поле Процент списания
	ПолеНовогоЭлемента                           = Элементы.Добавить(ПараметрыСозданияЭлементовФормы.СоставУслугПроцентСписания + ИДСтрокиДанных, Тип("ПолеФормы"), ГруппаНовыхЭл);													 
	ПолеНовогоЭлемента.Вид                       = ВидПоляФормы.ПолеВвода;
	ПолеНовогоЭлемента.АвтоМаксимальнаяШирина    = Ложь;
	ПолеНовогоЭлемента.МаксимальнаяШирина        = 3;
	ПолеНовогоЭлемента.РастягиватьПоГоризонтали  = Истина;
	ПолеНовогоЭлемента.ПутьКДанным               = "Объект.ПакетУслугСоставУслуг[" + ИДСтрокиДанных +"].ПроцентСписания";
	ПолеНовогоЭлемента.ПоложениеЗаголовка		 = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеНовогоЭлемента.УстановитьДействие("ПриИзменении", "УстановитьВидимостьЭлементовПриИзменении");	
	
	// Декорация %	
	ДекорацияПроцент = Элементы.Добавить("ДекорацияПроцент" + ИДСтрокиДанных, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
	ДекорацияПроцент.Заголовок = "%";
	
	// Кнопка удаления строки занятия	
	КнопкаУдаленияВремениПроведения                   = Элементы.Добавить(ПараметрыСозданияЭлементовФормы.СоставУслугКнопкаУдалить + ИДСтрокиДанных, Тип("КнопкаФормы"), ГруппаНовыхЭл);
	КнопкаУдаленияВремениПроведения.Отображение       = ОтображениеКнопки.Картинка;
	КнопкаУдаленияВремениПроведения.ИмяКоманды        = "УдалитьСтрочкуСоставУслуг";
	КнопкаУдаленияВремениПроведения.Картинка          = БиблиотекаКартинок.ОчиститьДанные;
	КнопкаУдаленияВремениПроведения.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля "ЧленствоПакетУслугСоставУслугУслугаСегмент"
//
Процедура ПакетУслугСоставУслугУслугаСегментПриИзменении_Подключаемый(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
	ТекущиеДанные = Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);
	
	Если ТекущиеДанные.ПереключательДляВыбораУслугаСегмент = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		// СтруктураПараметры = Новый Структура();
		// СписокДоступныхТипов = Новый СписокЗначений;
		// СписокДоступныхТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));		
		//
		// СтруктураПараметры.Вставить("СписокРазрешенныхТипов", СписокДоступныхТипов); 
		// СтруктураПараметры.Вставить("Заголовок"             , "Выбор услуг");	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПакетУслугСоставУслугУслугаСегментПриИзменении_ПодключаемыйЗавершение", ЭтаФорма, Элемент);
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли ТекущиеДанные.ПереключательДляВыбораУслугаСегмент = 1 Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПакетУслугСоставУслугУслугаСегментПриИзменении_Подключаемый2", ЭтаФорма, Элемент);
		ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Членство пакет услуг состав услуг услуга сегмент при изменении подключаемый завершение
// Завершение немодального открытия окна формы - Справочник Номенклатура - ФормаВыбораНоменклатурыПоСегменту
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения
//
Процедура ПакетУслугСоставУслугУслугаСегментПриИзменении_ПодключаемыйЗавершение(Результат, Параметры)  Экспорт
	
	Элемент = Параметры;
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
	ТекущиеДанные = Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);
	Если ЗначениеЗаполнено(Результат) Тогда
		Если НЕ Объект.Ссылка = Результат Тогда
			ТекущиеДанные.УслугаСегмент = Результат;		
			УстановитьВидимостьЭлементов();
		КонецЕсли;
	ИначеЕсли Элемент.Имя = ПараметрыСозданияЭлементовФормы.СоставУслугПереключательУслугаСегмент + ИДСтрокиДанных Тогда
		ТекущиеДанные.ПереключательДляВыбораУслугаСегмент = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Членство пакет услуг состав услуг услуга сегмент при изменении подключаемый2
// Завершение немодального открытия окна формы - Справочник Сегменты номенклатуры - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
Процедура ПакетУслугСоставУслугУслугаСегментПриИзменении_Подключаемый2(Результат, Параметры)  Экспорт
	
	Значение = Результат;
	Элемент = Параметры;
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
	ТекущиеДанные = Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ТекущиеДанные.УслугаСегмент = Значение;
		УстановитьВидимостьЭлементов();
	ИначеЕсли Элемент.Имя = ПараметрыСозданияЭлементовФормы.СоставУслугПереключательУслугаСегмент + ИДСтрокиДанных Тогда
		ТекущиеДанные.ПереключательДляВыбораУслугаСегмент = 0;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура УстановитьВидимостьЭлементовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура УстановитьЗаголовокЭлементовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Очистка"
//
Процедура ПакетУслугСоставУслугУслугаСегментОчистка(Элемент, СтандартнаяОбработка)
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(Элемент.Имя);	
	ТекущиеДанные = Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.УслугаСегмент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура УдалитьСтрочкуСоставУслуг(Команда)
	
	ИДСтрокиДанных = ИдентификаторСтрокиДанныхПоИмениЭлемента(ЭтаФорма.ТекущийЭлемент.Имя);	
	УдалитьЭлементыФормыСоставУслуг(ИДСтрокиДанных);
	
КонецПроцедуры

&НаСервере
// Удалить элементы формы связанные с удаляемым временем занятия
//
Процедура УдалитьЭлементыФормыСоставУслуг(ИДСтрокиДанных)
	
	// При удалении выбранного времени занятия проводим удаление элементов
	// формы и строки в таблице данных т.к. индексы в таблице данных
	// смещаются, необходимо переопределить путь к данным для элементов
	// следующих после удаленных. Сделать это невозможно, поэтому мы вынуждены 
	// создать их заново.
	
	// Ищем строку в данных по ИД
	СтрокаДанных = Объект.ПакетУслугСоставУслуг.НайтиПоИдентификатору(ИДСтрокиДанных);	
	Если СтрокаДанных <> Неопределено Тогда
		
		// Удаляем элементы
		Для Каждого СтрокаТЗ Из Объект.ПакетУслугСоставУслуг Цикл
			Элементы.Удалить(Элементы[ПараметрыСозданияЭлементовФормы.СоставУслугКнопкаУдалить				 + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы[ПараметрыСозданияЭлементовФормы.СоставУслугВидЦены					 + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы[ПараметрыСозданияЭлементовФормы.СоставУслугУслугаСегмент				 + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы[ПараметрыСозданияЭлементовФормы.СоставУслугПереключательУслугаСегмент	 + СтрокаТЗ.ПолучитьИдентификатор()]);
			Элементы.Удалить(Элементы[ПараметрыСозданияЭлементовФормы.СоставУслугГруппаЭлементов			 + СтрокаТЗ.ПолучитьИдентификатор()]);
		КонецЦикла;
		
		// Удалить строку из данных
		Объект.ПакетУслугСоставУслуг.Удалить(СтрокаДанных);
		
		// Создаем элементы взамен удаленных на пред. этапе	  
		Для Каждого СтрокаТЗ Из Объект.ПакетУслугСоставУслуг Цикл
			ДобавитьЭлементыФормыСоставаУслуг(СтрокаТЗ.ПолучитьИдентификатор());				
		КонецЦикла;
		
		УстановитьВидимостьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция вернет идентификатор строки данных по имени элемента
//
Функция ИдентификаторСтрокиДанныхПоИмениЭлемента(ИмяЭлемента)
	
	НомерСимвола = Найти(ИмяЭлемента,"_");
	Возврат Число(Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента) - НомерСимвола)); 
	
КонецФункции

&НаСервере
// Процедура, устанавливает видимость элементов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьЭлементов()
	
	// -----------------------------------Ограничение процента списания---------------------------------------	
	
	Если Объект.НеОграниченПроцентомСписания Тогда		
		Элементы.ОграничениеСписанияПроцент.Видимость 	= Ложь;
		Элементы.ДекорацияПроцент.Видимость 			= Ложь;		
	Иначе		
		Элементы.ОграничениеСписанияПроцент.Видимость 	= Истина;
		Элементы.ДекорацияПроцент.Видимость 			= Истина;		
	КонецЕсли;	
	
	// -----------------------------Ограничение срока действия бонусного счета--------------------------------
	
	// Бессрочный
	Если Объект.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный  Тогда 
		
		Элементы.ГруппаПараметрыСрокаДействия.Видимость 			= Ложь;
		Элементы.ГруппаПараметрыСрокаДействияДата_С_По.Видимость 	= Ложь;
		
	// Срок действия с.. по..
	ИначеЕсли Объект.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокДействия_С_По Тогда	
		
		Если Объект.СрокДействияДатойС = Дата(1,1,1) Тогда 
			Объект.СрокДействияДатойС = ТекущаяДата();
		КонецЕсли;	
		
		Элементы.ГруппаПараметрыСрокаДействия.Видимость 			= Ложь;
		Элементы.ГруппаПараметрыСрокаДействияДата_С_По.Видимость 	= Истина;
		
	// Срок ограничен периодом	
	ИначеЕсли Объект.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда
		
		Элементы.ГруппаПараметрыСрокаДействия.Видимость 			= Истина;
		Элементы.ГруппаПараметрыСрокаДействияДата_С_По.Видимость 	= Ложь;
		
	Иначе 
		
		Элементы.ГруппаПараметрыСрокаДействия.Видимость 			= Ложь;
		Элементы.ГруппаПараметрыСрокаДействияДата_С_По.Видимость 	= Ложь;
		
	КонецЕсли;
	
	// -----------------------Ограничение срока действия начислений бонусного счета--------------------------
	
	// Бессрочный
	Если Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный  Тогда 
		
		Элементы.ГруппаПараметрыСрокаДействияНачислений.Видимость = Ложь;
		
	// Срок ограничен периодом	
	ИначеЕсли Объект.ОграничениеНачисленийПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда
		
		Элементы.ГруппаПараметрыСрокаДействияНачислений.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаПараметрыСрокаДействияНачислений.Видимость = Ложь;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
